# -*- coding: utf-8 -*-

import configparser
import os

conf = configparser.ConfigParser()
conf.read(os.getcwd() + '/yzwspider/schools.ini','utf8')
# 省市代码 默认11（北京）可为空
ssdm = conf.get('config','ssdm')

# 门类代码 默认08 （工学）可为空
mldm = conf.get('config','mldm')

# 一级学科代码 可为空
yjxkdm = conf.get('config','yjxkdm')

# 专业名称  可为空
zymc = conf.get('config','zymc')

# excel文件名称
filename = conf.get('config', 'filename')

# 若为True 将在完成爬取任务一分钟后自动关机 默认为False
auto_shutdown = conf.get('config', 'auto_shutdown')
#一级学科目录文件名称
FCSI_File = 'first_class_subject_index.txt'

# MySQL
MySQL = conf.get('MySQL', 'MySQL')
host = conf.get('MySQL', 'host')
user = conf.get('MySQL', 'user')
password = conf.get('MySQL', 'password')
port = conf.getint('MySQL', 'port')
# 数据库数据表 需自行创建
database = conf.get('MySQL', 'database')
table = conf.get('MySQL', 'table')


# 固定内容
provinceList = ['11', '12', '13', '14', '15', '21', '22', '23', '31', '32', '33', '34', '35', '36', '37',
                '41', '42', '43', '44', '45', '46', '50', '51', '52', '53', '54', '61', '62', '63', '64', '65', '71',
                '81', '82']
dict = {'35': '福建', '21': '辽宁', '51': '四川', '34': '安徽', '63': '青海', '42': '湖北', '64': '宁夏', '33': '浙江', '46': '海南',
        '82': '台湾', '61': '陕西', '37': '山东', '41': '河南', '13': '河北', '45': '广西', '54': '西藏', '14': '山西', '81': '澳门',
        '36': '江西', '52': '贵州', '50': '重庆', '44': '广东', '32': '江苏', '53': '云南', '71': '香港', '11': '北京', '31': '上海',
        '23': '黑龙江', '62': '甘肃', '22': '吉林', '65': '新疆', '43': '湖南', '15': '内蒙古', '12': '天津'}
list_985 = ["北京大学", "清华大学", "中国科学技术大学", "南京大学", "复旦大学", "上海交通大学", "西安交通大学", "浙江大学", "哈尔滨工业大学", "北京理工大学", "南开大学", "天津大学",
            "东南大学", "武汉大学", "华中科技大学", "吉林大学", "厦门大学", "山东大学", "中国海洋大学", "湖南大学", "中南大学", "大连理工大学", "北京航空航天大学", "重庆大学",
            "四川大学", "电子科技大学", "中山大学", "华南理工大学", "兰州大学", "西北工业大学", "东北大学", "同济大学", "北京师范大学", "中国人民大学", "中国农业大学",
            "国防科技大学", "中央民族大学", "华东师范大学", "西北农林科技大学"]
list_211 = ["北京大学", "中国人民大学", "清华大学", "北京交通大学", "北京工业大学", "北京航空航天大学", "北京理工大学", "北京科技大学", "北京化工大学", "北京邮电大学", "中国农业大学",
            "北京林业大学", "北京中医药大学", "北京师范大学", "北京外国语大学", "中国传媒大学", "中央财经大学", "对外经济贸易大学", "北京体育大学", "中央音乐学院", "中央民族大学",
            "中国政法大学", "华北电力大学", "华北电力大学(保定)", "南开大学", "天津大学", "天津医科大学", "河北工业大学", "太原理工大学", "内蒙古大学", "辽宁大学", "大连理工大学",
            "东北大学", "大连海事大学", "吉林大学", "延边大学", "东北师范大学", "哈尔滨工业大学", "哈尔滨工程大学", "东北农业大学", "东北林业大学", "复旦大学", "同济大学",
            "上海交通大学", "华东理工大学", "东华大学", "华东师范大学", "上海外国语大学", "上海财经大学", "上海大学", "第二军医大学", "南京大学", "苏州大学", "东南大学",
            "南京航空航天大学", "南京理工大学", "中国矿业大学", "中国矿业大学(北京)", "河海大学", "江南大学", "南京农业大学", "中国药科大学", "南京师范大学", "浙江大学", "安徽大学",
            "中国科学技术大学", "合肥工业大学", "厦门大学", "福州大学", "南昌大学", "山东大学", "中国海洋大学", "中国石油大学", "中国石油大学(华东)", "中国石油大学(北京)",
            "郑州大学", "武汉大学", "华中科技大学", "中国地质大学", "中国地质大学(北京)", "中国地质大学(武汉)", "武汉理工大学", "华中农业大学", "华中师范大学", "中南财经政法大学",
            "湖南大学", "中南大学", "湖南师范大学", "国防科学技术大学", "中山大学", "暨南大学", "华南理工大学", "华南师范大学", "广西大学", "海南大学", "四川大学", "西南交通大学",
            "电子科技大学", "四川农业大学", "西南财经大学", "重庆大学", "西南大学", "贵州大学", "云南大学", "西藏大学", "西北大学", "西安交通大学", "西北工业大学",
            "西安电子科技大学", "长安大学", "西北农林科技大学", "陕西师范大学", "第四军医大学", "兰州大学", "青海大学", "宁夏大学", "新疆大学", "石河子大学"]
subjectIndex = {'06': '历史学', '12': '管理学', '07': '理学', '03': '法学', '08': '工学', '13': '艺术学', '10': '医学', '11': '军事学',
                '05': '文学', '04': '教育学', '01': '哲学', '09': '农学', '02': '经济学'}
